In [6]:
df.describe()

           marks
count   4.000000
mean   85.250000
std     6.800735
min    76.000000
25%    82.750000
50%    86.500000
75%    89.000000
max    92.000000

In [5]:
df.info()

<class 'pandas.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   student  4 non-null      str
 1   marks    4 non-null      int64
 2   passed   4 non-null      bool
dtypes: bool(1), int64(1), str(1)
memory usage: 200.0 bytes

In [3]:
data = {"student": ["Amit", "Bhavna", "Chirag", "Deepa"],
     "marks": [85, 92, 76, 88],
     "passed": [True, True, False, True],
}
df = pd.DataFrame(data)
df

  student  marks  passed
0    Amit     85    True
1  Bhavna     92    True
2  Chirag     76   False
3   Deepa     88    True

In [1]:
import pandas as pd